tap "homebrew/bundle"
tap "homebrew/services"
tap "ryu0118/dgraph"
brew "borgbackup"
brew "borgmatic"
brew "btop"
brew "cmatrix"
brew "docker"
brew "dotnet"
brew "dpkg"
brew "dune"
brew "fakeroot"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gradle"
brew "huggingface-cli"
brew "inetutils"
brew "jq"
brew "libftdi"
brew "libimobiledevice"
brew "mas"
brew "minicom"
brew "mysql"
brew "neovim"
brew "nethack"
brew "ocaml"
brew "opam"
brew "openjdk@17"
brew "pacvim"
brew "php", restart_service: :changed
brew "picocom"
brew "pipx"
brew "python@3.10"
brew "qemu"
brew "speedtest-cli"
brew "starship"
brew "strongswan"
brew "tldr"
brew "tmux"
brew "wimlib"
cask "arc"
cask "arduino-ide"
cask "detexify"
cask "dotnet-runtime"
cask "duplicati"
cask "forklift"
cask "google-drive"
cask "intellij-idea-ce"
cask "knockknock"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "nextcloud"
cask "obsidian"
cask "raspberry-pi-imager"
cask "rectangle"
cask "save-hollywood"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "zoom"
cask "zulip"
mas "AusweisApp", id: 948660805
mas "Bitwarden", id: 1352778147
mas "CHM Reader - Enjoy", id: 1661528239
mas "CrystalFetch", id: 6454431289
mas "HEIC Converter", id: 1294126402
mas "HP Smart", id: 1474276998
mas "HTTPBot", id: 1232603544
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Symbols", id: 1612933742
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "UTM", id: 1538878817
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "cucumberopen.cucumber-official"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "formulahendry.dotnet-test-explorer"
vscode "franneck94.c-cpp-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hansampfaall.dimacs"
vscode "janisdd.vscode-edit-csv"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-maui"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ocamllabs.ocaml-platform"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "statelyai.stately-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "wavetrace.wavetrace"
vscode "zxh404.vscode-proto3"
