tap "homebrew/bundle"
tap "homebrew/services"
tap "ryu0118/dgraph"
brew "borgbackup"
brew "borgmatic"
brew "gradle"
brew "libftdi"
brew "mas"
brew "minicom"
brew "neovim"
brew "nethack"
brew "openjdk@17"
brew "pacvim"
brew "php", restart_service: :changed
brew "picocom"
brew "pipx"
brew "starship"
brew "strongswan"
brew "tmux"
brew "wimlib"
cask "arc"
cask "arduino-ide"
cask "google-drive"
cask "intellij-idea-ce"
cask "knockknock"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "nextcloud"
cask "obsidian"
cask "raspberry-pi-imager"
cask "rectangle"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "zoom"
cask "zulip"
mas "Battery Monitor", id: 836505650
mas "Bitwarden", id: 1352778147
mas "CHM Reader - Enjoy", id: 1661528239
mas "HEIC Converter", id: 1294126402
mas "HP Smart", id: 1474276998
mas "HTTPBot", id: 1232603544
mas "InjectionIII", id: 1380446739
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "PL2303Serial", id: 1624835354
mas "SPIKE", id: 6443545905
mas "Strongbox", id: 897283731
mas "Symbols", id: 1612933742
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Usage", id: 1561788435
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "hansampfaall.dimacs"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-maui"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "sswg.swift-lang"
vscode "swiftlang.swift-vscode"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
